Repository: kamikadza13/Text-grabber
Catalog: locale/*/LC_MESSAGES/T_test.po
Languages: ru

source: Text Grabber Settings
ru: Text Grabber Настройки

source: Enter your language
ru: Введите свой язык

source: Select language:
ru: Выберите язык:

source: Choose the language you are going to translate mods into. Rimworld официально переведен на несколько языков и для чтобы ваш перевод мода был автоматически добавлен в игру, а не выступал как отдельный новый язык, используйте предустановленные языки из списка.
ru: Выберите язык, на который вы собираетесь переводить моды Rimworld официально переведен на несколько языков и для чтобы ваш перевод мода был автоматически добавлен в игру, а не выступал как отдельный новый язык, используйте предустановленные языки из списка.

source: Choose the language you are going to translate mods into. Rimworld has been officially translated into several languages, and in order for your translation of the mod to be automatically added to the game, and not act as a separate new language, use the preset languages from the list. If you want to change the program language, then the language is selected at the top next to the program close button.
ru: Выберите язык, на который вы собираетесь переводить моды Rimworld официально переведен на несколько языков и для чтобы ваш перевод мода был автоматически добавлен в игру, а не выступал как отдельный новый язык, используйте предустановленные языки из списка. Если вы хотите изменить язык программы, то язык выбирвается вверху рядом с кнопкой закрытия программы"

source: Pathes to Rimworld folders
ru: Пути к папкам Rimworld

source: Select Data folder
ru: Выберите папку Rimworld Data

source: Select path to Rimworld Data
ru: Выберите папку Rimworld Data

source: Select MOD folder
ru: Выберите папку модов Rimworld

source: Rimworld Mods Folder: {Path_to_Mod_folder}
ru: Rimworld Папка с модами: {Path_to_Mod_folder}

source: Select path to Rimworld Mods Folder
ru: Выберите папку модов Rimworld

source: Select Another mod folder
ru: Выберите дополнительную папку модов Rimworld

source: Another Rimworld Mods Folder: {Path_to_Another_folder}
ru: Другая папка с модами: {Path_to_Another_folder}

source: Select path to another Rimworld Mods Folder
ru: Выберите дополнительную папку модов Rimworld

source: If you suddenly store mods somewhere else, you can specify this folder here. In this case, the program will work better with mods that depend on other mods (in case the values for translation are inherited from another mod).
ru: Если вы внезапно храните моды где-то еще, то можете указать эту папку тут. В этом случае программа будет лучше работать с модами, которые зависят от других модов (В случае, если значения для перевода наследуются от другого мода).

source: Extraction files rules
ru: Правила извлечения файлов

source: Delete old version folders
ru: Удалить папки со старыми версиями

source: Delete (Not extract) text for older versions of Rimworld. By default, the program extracts text for all available versions ( ... 1.0, 1.1, 1.2 ...). You can leave only the newest version, so as not to translate too much (Which I advise you to do)
ru: Удалять (Не извлекать) текст для старых версий Rimworld. По умолчанию программа извлекает текст для всех доступных версий ( ... 1.0, 1.1, 1.2 ...). Вы можете оставить только самую новую версию, чтобы не переводить лишнего (Что я вам и советую)

source: Merge Folders
ru: Объединять папки

source: Merge version and Language folders into one Language folder (If there is only one version folder)
ru: Объединить папки версий и Language в одну папку Language (Работает только если существует только одна папка версий)

source: Not rename files
ru: Не переименовывать файлы

source: Files are automatically renamed depending on the folders they fall into. This is necessary to prevent the files from having the same names, which may lead to the fact that the game will not read the translation files. (Check the box if you don't like it and you want to keep the original titles)
ru: Файлы автоматически переименовываются в зависимости от того, в какие папки они попадают. Это необходимо для того, чтобы файлы не имели одинаковых имен, что может привести к тому, что игра не будет читать файлы перевода. (Установите флажок, если вам это не нравится и вы хотите сохранить оригинальные названия)

source: Add in file comment with FullPath of Original file
ru: Добавьте в файл комментарий с полным путем к исходному файлу

source: Add comments to grabbed text
ru: Добавлять комментарии с извлеченным текстом

source: Add "EN:" before comment text
ru: Добавить "EN:" перед текстом комментария

source: Place the comment text exactly above the original text
ru: Размещать текст комментария точно над исходным текстом

source: Left spacing are in before the comment
ru: Левый интервал находится перед комментарием

source: Comment replace \n as new line
ru: Замена \n новой строкой

source: Add stuffAdjective and mark it
ru: Добавить stuffAdjective и пометить его

source: Some materials can be used to build buildings / make objects, but the authors do not add a special label for this. And in translation it turns out: 'Made of stone'. This is normal for English, but not for some languages. Therefore, I decided to add a special label to understand how to translate a word as an adjective/ genitive. You can write yourself how to designate such words in the text. To correctly translate such a word, you need to mentally put 'The house is made of' in front of it. '~LABEL~' will be replaced with the original word. If you just want to add such words for translation, but do not want to mark them separately, then you can only write '~LABEL~'.
ru: Из некоторых материалов можно строить здания / делать предметы, но авторы не добавляют специальную метку для этого. И в переводе получается: 'Сделанный из камень'. Для английского языка это нормально, но для некоторых языков нет. Поэтому я решил добавить специальную метку, чтобы понимать как нужно переводить слово как прилагательное / родительный падеж. Вы можете написать сами как обозначать в тексте такие слова. '~LABEL~' будет заменен на оригинальное слово. Если вы хотите просто добавить такие слова для перевода, но не хотите их отдельно отмечать, то можете написать только '~LABEL~'.

source: '~LABEL~' will be replaced with the original word. If you just want to add such words for translation, but do not want to mark them separately, then you can only write '~LABEL~'
ru: "~LABEL~" будет заменен исходным словом. Если вы просто хотите добавить такие слова для перевода, но не хотите отмечать их отдельно, то вы можете написать только '~LABEL~'

source: Check at least one letter in text
ru: Проверять хотя бы одну букву в тексте

source: Check if there is at least one letter in the extracted text. This is necessary so as not to extract all sorts of (255, 123, 112). You may want to remove the flag if the mod adds various symbols without letters that you want to translate like "<--", I do not know why to translate it at all, but who knows ^_^
ru: Проверять, есть ли в извлеченном тексте хотя бы одна буква. Это необходимо для того, чтобы не извлекать всевозможные (255, 123, 112). Возможно, вы захотите удалить флаг, если мод добавляет различные символы без букв, которые вы хотите перевести, например, такой как "<--", Я вообще не знаю, зачем это переводить, но кто знает ^_^

source: Add titleFemale if it is not in the original file
ru: Добавлять titleFemale, если его нет в исходном файле

source: Add titleShortFemale if it is not in the original file
ru: Добавьте titleShortFemale, если его нет в исходном файле

source: QuestScriptDef Tkey system
ru: QuestScriptDef Tkey система

source: At 1.4 patch TKey system was broken. If the developers fix it, then enable this feature. The Tkey system is specifically designed to simplify long tag paths.
ru: В патче 1.4 система TKey была сломана. Если разработчики это исправят, то включите эту функцию. Система Tkey специально разработана для укорочения длинных путей к тегам"

source: Add labelPlural
ru: Добавлять labelPlural

source: Add missing tags to choose from in PawnKindDef if they don't exist.
ru: Добавлять отсутствующие теги в PawnKindDef

source: Add labelMale
ru: Добавлять labelMale

source: Add labelFemale
ru: Добавлять labelFemale

source: Add labelMalePlural
ru: Добавлять labelMalePlural

source: Add labelFemalePlural
ru: Добавлять labelFemalePlural

source: Spacing
ru: Отступы

source: Grabbed lines left spacing
ru: Левый отступ

source: One tab
ru: Один Tab

source: Two spaces
ru: Два пробела

source: No spaces
ru: Без отступа

source: Add empty line before new grabbed defname
ru: Добавлять пустую строку перед новым извлеченным defname

source: Divide the text into blocks by Defname
ru: Разделять текст на блоки по Defname

source: Threshold for adding an empty line
ru: Порог добавления пустых строк

source: Empty lines will be added if there are many lines with the same defname in the file. (If the number of different defnames is less than half of all strings.)
ru: Пустые строки будут добавлены в том случае, если в файле много строк с одинаковым defname. (Если количество различных defname меньше половины от всех строк.)

source: Description
ru: Описание

source: ~MOD_NAME~ will be replaced with the name of the original mod ~MOD_DESCRIPTION~ will be replaced with the original mod description ~MOD_URL~ will be replaced with the original mod URL
ru: ~MOD_NAME~ будет заменено названим оригинального мода ~MOD_DESCRIPTION~ будет заменено оригинальным описанием мода ~MOD_URL~ будет заменено исходным URL-адресом мода

source: Author
ru: Автор

source: New Name
ru: Новое название

source: ~MOD_NAME~ will be replaced with the name of the original mod.
ru: ~MOD_NAME~ будет заменено названием оригинального мода.

source: Add modDependencies
ru: Добавлять modDependencies

source: Example About.xml
ru: Пример About.xml

source: Image position
ru: Позиция картинки

source: Top left
ru: Вверху слева

source: Top right
ru: Вверху справа

source: Center
ru: В центре

source: Bottom left
ru: Снизу слева

source: Bottom right
ru: Снизу справа

source: Add an image to the preview
ru: Добавлять картинку на превью

source: Add YOUR image to the original mod preview.
ru: Добавлять СВОЕ изображение в превью в About

source: Select Your image
ru: Выбрать картинку

source: x Offset
ru: Смещение по Х

source: y Offset
ru: Смещение по У

source: Tags for extraction
ru: Тэги для извлечения

source: Tags to extraction
ru: Извлекаемые теги

source: <Tags> to be extracted for translation, for example, if you want to extract "anima heart" from <label>anima heart</label>, then the list of tags to extract should be "label"
ru: <Тэги>, которые будут извлечены для перевода, например, если вы хотите, чтобы было извлечено "anima heart" из <label>anima heart</label>, то в списке тэгов для извлечения должен быть "label""

source: Part of tag to extraction
ru: Часть тега для извлечения

source: If you need to extract all <tags> that have a common part, for example, all <tags> with "Message". Such as: <NewMessage>Hello</NewMessage> <OldMessage>Hello</OldMessage> <Message1>Hello</Message1> Case-sensitive
ru: Если нужно извлечь все <тэги>, имеющие общую часть, например, все <тэги> с "Message". Такие как: <NewMessage>Hello</NewMessage> <OldMessage>Hello</OldMessage> <Message1>Hello</Message1> Регистр важен

source: Tags before <li>
ru: Теги перед <li>

source: A list of <tags> that are in front of a set of consecutive <li> that need to be output like:<rulePack> <rulesStrings> <li>RBTStownend->Fieldarmy Base</li> <li>RBTStownend->Power Station</li> <li>RBTStownend->Powerplant</li> </rulesStrings> </rulePack> Add tags here only if you are completely sure that Rimworld supports these lists So, for example, in 1.3 "thoughtStageDescriptions" are not supported, and you have to write each line separately
ru: Список <тегов>, которые находятся перед набором последовательных <li>, которые необходимо вывести например:<rulePack> <rulesStrings> <li>RBTStownend->Fieldarmy Base</li> <li>RBTStownend->Power Station</li> <li>RBTStownend->Powerplant</li> </rulesStrings> </rulePack> Добавляйте сюда тэги только если полностью уверены, что Rimworld поддерживает эти списки Так, например, в 1.3 "thoughtStageDescriptions" не поддерживается, и приходится каждую строчку писать отдельно

source: Forbidden
ru: Запрещенное

source: Forbidden tags
ru: Запрещенные теги

source: <Tags> that will not be extracted. Usually you don't need to add much here, but if the program constantly extracts something superfluous, then it makes sense to prohibit the extraction of the tag in any way The first way is to prohibit the extraction of this particular <Tag>. In this case, those tags that completely match the list will not be extracted. For example <developmentalStageFilter>Baby, Child, Adult</developmentalStageFilter> Because this line is very similar to normal text, which it would be desirable to extract because there are spaces in it, <tag> should be banned.
ru: <Тэги>, которые не будут извлечены. Обычно сюда не нужно много добавлять, но если программа постоянно извлекает что-то лишнее, то имеет смысл запретить извлечение тэга каким-либо способом Первый из способов это запретить извлечения именно этого <Тэга>. В данном случае не будут извлекаться те тэги, которые полностью совпадают со списком Например <developmentalStageFilter>Baby, Child, Adult</developmentalStageFilter> Т.к. эта строка очень похожа на нормальный текст, который было бы желательно извлечь т.к. в ней есть пробелы, <Тэг> нужно запретить.

source: Forbidden part of tag
ru: Запрещенные части тега

source: If you need to prohibit extraction of all <tags> that have a common part, for example, all <tags> with "Texture". Such as: <Texture>Texture1.png</Texture> <Old_Texture>Texture2.png</Old_Texture> <MetalTexture>Texture3.png</MetalTexture> Case-sensitive
ru: Если нужно запретить все <тэги>, имеющие общую часть, например, все <тэги> с "Texture". Такие как: <Texture>Texture1.png</Texture> <Old_Texture>Texture2.png</Old_Texture> <MetalTexture>Texture3.png</MetalTexture> Регистр важен

source: Forbidden part of path
ru: Запрещенные части пути

source: If you need to prohibit all tags that have a common part of the path: So for <TraitDef> <defName>ReunionCharacter</defName> <degreeDatas> <li> <label>Ally</label> </li> </degreeDatas> </TraitDef> The path to the text "Ally" will be"/TraitDef/ReunionCharacter/degreeDatas/li/label" And you can prohibit, for example, /degreeDatas/li/
ru: Если нужно запретить все тэги, у которых есть общая часть пути: Так для <TraitDef> <defName>ReunionCharacter</defName> <degreeDatas> <li> <label>Ally</label> </li> </degreeDatas> </TraitDef> Путь к тексту "Ally" будет "/TraitDef/ReunionCharacter/degreeDatas/li/label" А запретить можно, например, /degreeDatas/li/

source: Forbidden text
ru: Запрещенный текст

source: Sometimes it is necessary to prohibit not the <Tag> but the text. For example, all sorts of true false can sometimes be extracted by the program <ThingDef> <defName>AnimaHeart</defName> <useHitPoints_label>true</useHitPoints_label> </ThingDef> Since there is a label in the <useHitPoints_label> tag, such a tag may be mistakenly extracted. Therefore, you can either prohibit such a tag, or prohibit the text 'true'. If the text in the Tag completely matches the text added to the prohibited list, it will not be extracted
ru: Иногда требуется запретить не <Тег> а текст. Например всякие true false могут иногда извлекаться программой <ThingDef> <defName>AnimaHeart</defName> <useHitPoints_label>true</useHitPoints_label> </ThingDef> Т.к. в Тэге <useHitPoints_label> есть label, то такой тэг может быть ошибочно извлечен. Поэтому можно как запретить именно такой тэг, так и запретить текст 'true'. Если текст в Тэге будет полностью совпадать с добавленным в список запрещенного текста, то он не будет извлечен

source: Other
ru: Остальное

source: <li> class replace
ru: Замена в <li Class>

source: Sometimes TranslationReport wants some <li> to be replaced not with numbers, but with text, depending on "li Class=" for example: <QuestScriptDef> <li Class="QuestNode_Letter"> <label>Quest expired</label> </li> <QuestScriptDef> Normally the extracted text would be like this: <0.label>Quest expired<0.label> But the game wants him to be like this: <Letter.label>Quest expired<Letter.label> And the game takes the "Letter" from the <li> class, so I added the replacement of QuestNode_ with an empty string
ru: Текст до "=" это то, что будет заменяться, текст после - то, на что будет заменятьсяИногда TranslationReport хочет, чтобы некоторые li были заменены не на цифры, а на текст, в зависимости от "li Class=" например: <QuestScriptDef> <li Class="QuestNode_Letter"> <label>Quest expired</label> </li> <QuestScriptDef> Обычно извлеченный текст был бы таким: <0.label>Quest expired<0.label> Но игра хочет, чтобы он был таким: <Letter.label>Quest expired<Letter.label> И "Letter" игра берет из класса <li>, Поэтому я добавил замену QuestNode_ на пустую строку

source: General Settings
ru: Общие настройки

source: Comments
ru: Комментарии

source: Grabbing
ru: Извлечение

source: Preview
ru: Превью

source: Advanced settings
ru: Сложные настройки

source: FOUNDED NEW VALUE!
ru: Найдено новое значение!

source: FOUNDED NEW VALUE - {option_name} Please Check tab {option_section}
ru: НАЙДЕНО НОВОЕ ЗНАЧЕНИЕ - {option_name} Пожалуйста проверте вкладку {option_section}

source: Error reading {file_name}
ru: Ошибка чтения {file_name}

source: The settings have been moved to AppData\Roaming\Text_grabber\Settings
ru: Настройки были перенесены в AppData\Roaming\Text_grabber\Settings

source: A new value has been found!
ru: Было найдено новое значение!

source: New values have been found!
ru: Были найдены новые значения!

source: New values have been found in sections - {option_section} Please Check {option_names}
ru: Новые значения были найдены в секциях - {option_section} Пожалуйста проверьте {option_names}
